app/controllers/details_controller.rb

  def show
    @details =Detail.all
---
SELECT "details".* FROM "details"

  def create
      @details = Detail.new(form_params)
      if @details.save
---
INSERT INTO "details" ("firstname", "lastname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["firstname", "sumanth"], ["lastname", "sdln"], ["created_at", "2018-07-08 06:19:36.123755"], ["updated_at", "2018-07-08 06:19:36.123755"]]